module.exports = {
  // Устанавливает ширину табуляции в 2 пробела
  tabWidth: 2,

  // Вставляет точку с запятой в конце каждого выражения
  semi: true,

  // Использует одинарные кавычки вместо двойных
  singleQuote: true,

  // Добавляет запятую в конце массивов и объектов
  trailingComma: 'all',

  // Добавляет пробелы внутри фигурных скобок объектов
  bracketSpacing: true,

  // Отображает фигурные скобки объектов на новой строке
  bracketSameLine: false,

  // Всегда добавляет скобки вокруг параметров в стрелочных функциях
  arrowParens: 'always',
};
